Revit 2024 API
AssetProperty.IsReadOnly Property
 Identifies if the object is read-only or modifiable. If true, the object may not be modified. If false, the object's contents may be modified.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsReadOnly { get; }
Visual Basic
Public ReadOnly Property IsReadOnly As Boolean
	Get
Visual C++
public:
property bool IsReadOnly {
	bool get ();
}
See Also
AssetProperty Class
Autodesk.Revit.DB.Visual Namespace